Repository: MarvinFS/InterstellarRiftServerExtender-Translations
Catalog: *.resx
Languages: ru_ru

# Initialization
source: Interstellar Rift Extended Server v{0} Initializing....
ru_ru: Инициализация сервера Interstellar Rift Extended v{0} ...

# IRNotFound
source: IRSE: IR.EXE wasn't found. Make sure IRSE.exe is in the same folder as IR.exe. Press enter to close.
ru_ru: IRSE: файл IR.EXE не найден. Убедитесь, что IRSE.exe находится в одной папке с файлом IR.exe. Нажмите ENTER, для того чтобы закрыть окно.

# GameConsoleEnabled
source: IRSE: Game Console Commands Enabled.
ru_ru: IRSE: Консольные команды включены.

# ServerIsAlreadyRunning
source: The server is already running!
ru_ru: Сервер уже запущен!

# StopRunningServers
source: Attempting to stop any running servers.
ru_ru: Останавливаю сервер...

# UseDevVersion
source: IRSE: (Arg: -usedevversion is set) IRSE Will use Pre-releases versions
ru_ru: IRSE: (Аргумент: -usedevversion установлен) IRSE будет использовать тестовые версии

# NoUpdate
source: IRSE: (Arg: -noupdate is set or option in IRSE config is enabled) IRSE will not be auto-updated.
ru_ru: IRSE: (Аргумент: -noupdate установлен либо включен в настройках IRSE ) авто-обновление IRSE выключено.

# NoUpdateIR
source: IRSE: (Arg: -noupdateir is set) IsR Dedicated Server will not be auto-updated.
ru_ru: IRSE: (Аргумент: -noupdateir установлен) Авто-обновление серверных файлы игры отключено.

# AutoStart
source: IRSE: Arg: -autostart or Gui's Autostart Checkbox was Checked)
ru_ru: IRSE: Аргумент: -autostart установлен либо в настройках IRSE включена функция автостарта сервера.

# NonInteractive
source: Non interactive environment detected, GUI disabled
ru_ru: Поддержка вывода графики не обнаружена - Графический пользовательский интерфейс отключен

source: GUI Disabled
ru_ru: Графический интерфейс отключен

# CommandNoExist
source: IRSE: command Doesn't Exist.
ru_ru: IRSE: такой команды не существует..

# CommandException
source: Loading GUI...
ru_ru: Ошибка при выполнении команды...

# BadSyntax
source: Bad syntax ! Use / help to watch all valid commands
ru_ru: Неверный синтаксис! Используйте / help для вывода списка всех доступных команд...

source: For Game Version:
ru_ru: Для игры версии:

source: This Game Version:
ru_ru: Установленная версия игры:

source: Online Game Version:
ru_ru: Версия игры в Стиме:

# NewIRVersion
source: There is a new version of Interstellar Rift! Update your IR Installation!
ru_ru: Обнаружено обновление Interstellar Rift! Обновите сервер!

# IRNewer
source: Interstellar Rifts Version is newer than what this version of IRSE Supports, Check for IRSE updates!
ru_ru: Установленная версия Interstellar Rifts новее, чем поддерживаемые IRSE! Обновите IRSE!

source: Loading GUI...
ru_ru: Загружаю Графический Интерфейс...

# HelpCommand
source: help - this page ;)
ru_ru: Это страница Подсказки ;)

# OpenGUICommand
source: opengui - If closed, will open and/or focus the GUI to the front.
ru_ru: opengui - открыть графический интерфейс, если он был закрыт.

# StartCommand
source: start - Starts the server if its not running!
ru_ru: start - Запустить сервер, если он еще не запущен.

# StopCommand
source: stop - stops the server if it's running!
ru_ru: stop - Остановить сервер, если он запущен.

# RestartCommand
source: restart - Restarts IRSE, if autostart is set the server will start automatically.
ru_ru: restart - Перезапустить IRSE, если в настройках установлен автозапуск, то сервер игры так же будет запущен автоматически.

# CheckUpdateCommand
source: checkupdate - Checks for IRSE updates. Prompts user with new update details.
ru_ru: checkupdate - Проверить наличие обновлений IRSE. Выдает запрос на обновление.

# ForceUpdateCommand
source: forceupdate - Forces an Update of IRSE with no prompts.
ru_ru: forceupdate - Обновить IRSE: не выдает запросов на обновление.

# FailedInitPlugin
source: Failed initialization of Plugin {0}. Exception: {1}
ru_ru: Ошибка инициализации плагина {0}. Exception: {1}

# FailedLoadPlugin
source: Failed load of Plugin {0}. Exception: {1}
ru_ru: Ошибка загрузки плагина {0}. Exception: {1}

# FailedLoadAssembly
source: Failed to load assembly : {0} : {1}
ru_ru: Ошибка загрузки сборки : {0} : {1}

# FailedShutdownPlugin
source: Uncaught Exception in Plugin {0}. Exception: {1}
ru_ru: Ошибка остановки плагина: {0}. Exception: {1}

# InitializationPlugin
source: Initialization of Plugin {0} failed. Could not find a public, parameterless constructor for {0}
ru_ru: Ошибка загрузки плагина {0}. Не найден класс public: parameterless constructor for {0}

# InitializingPlugin
source: Initializing Plugin : {0}
ru_ru: Инициализация плагина : {0}

# LoadingPlugin
source: Loading Plugin : {0}
ru_ru: Загрузка плагина : {0}

# ShutdownPlugin
source: Shutting down Plugin {0}
ru_ru: Остановка плагина {0}
